# 파이썬 기초 ( 연산자, 수식, 문자열, 리스트 및 흐름제어(if, while, for))
# 사칙연산 + - * /
# 정수(int)
# 실수(float)

# 프로그래밍 언어에 존재하는 새로운 연산자

# 나머지 연산자 (%)

# >>> 7 % 3
# 7 = 2(몫) * 3 + 1(나머지)
# 1

# >>> 3 % 7
# 3 = 0(몫) * 7 + 3(나머지)
# 3

# 나눗셈 후 몫을 반환하는 연산자(//)

# >>> 7 // 4
# 1

# >>> 7 // 4
# 2

# 제곱 연산자(**)

# >>> 2 ** 3
# 8

# >>> 3 ** 4
# 81

# 조금 더 복잡한 계산 (효율적으로)
# 10명학생의 총합을 총합 이라는 변수에 저장

# 변수를 사용하자
# 변수란? 값을 저장할 수 있는 메모리상의 공간

# Ex 1
# total = 10+39+40+100+60+90+89+88+80+70
# average = total/10

# >>>average
# 66.6

# Ex 2
# 14//3 (몫)
# 14%3 (나머지)
#
# 확인 (14 // 3)*3 + (14 % 3)
# >>> 14

# 문자열 (string)
# 파이썬에서는 문자열 데이터를 "" or '' 로 둘러싼다.

""" 
여
러
줄
"""

'''
여
러
줄
'''

# 한줄
